ПД_sev/src/Documents/ЗаявкаНаТендер/ЗаявкаНаТендер.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаявкаНаТендер</name>
  <posting>Deny</posting>
  <registerRecords>AccumulationRegister.ТоварыНаСкладах</registerRecords>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИтоговаяСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПочтаПолучателя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеПоТЗ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Параметры</name>
    <attributes>
      <name>ИмяПараметра</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеПараметра</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ПД_sev/src/Catalogs/ХранилищеПрикрепленныхФайлов/ХранилищеПрикрепленныхФайлов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ХранилищеПрикрепленныхФайлов</name>
  <attributes>
    <name>Объект</name>
    <type>
      <types>DocumentRef</types>
      <types>CatalogRef</types>
    </type>
  </attributes>
  <attributes>
    <name>Хранилище</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Вид</name>
    <type>
      <types>CatalogRef.ВидыПрикремленныхДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Расширение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

ПД_sev/src/CommonForms/ФормаСвязанныеМакеты/Module.bsl
&НаСервере
Функция ОткрытьФайлНаСервере(Ссылка)
	ИмяФайла = Ссылка.ИмяФайла;
	АдресХранилища = ПоместитьВоВременноеХранилище(Ссылка.Хранилище.Получить(), УникальныйИдентификатор);
	Возврат новый Структура("ИмяФайла, АдресХранилища", ИмяФайла, АдресХранилища);
КонецФункции

&НаКлиенте
Процедура ОткрытьФайл(Команда)
	ТекСтрока = Элементы.Список.ТекущиеДанные;
	Если ТекСтрока = Неопределено Тогда
		Возврат
	КонецЕсли;
	стрФайл = ОткрытьФайлНаСервере(ТекСтрока.Ссылка);
	ИмяФайла = стрФайл.ИмяФайла;
	АдресХранилища = стрФайл.АдресХранилища; 
	ПолучитьФайл(АдресХранилища, ИмяФайла, Истина);	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Список.Параметры.УстановитьЗначениеПараметра("Объект", Параметры.Объект);
	Объект = Параметры.Объект;
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьФайлНаСервере(АдресФайла, ВыбранноеИмяФайла)
	Если АдресФайла = Неопределено Тогда
		Возврат	
	КонецЕсли;
	
	Файл = Новый Файл(ВыбранноеИмяФайла);
	ИмяФайла = Файл.Имя;
	Расширение = Файл.Расширение;
	НовыйЭлемент = Справочники.ХранилищеПрикрепленныхФайлов.СоздатьЭлемент();
	НовыйЭлемент.Объект = Объект; 
	НовыйЭлемент.Наименование = ИмяФайла;
	НовыйЭлемент.ИмяФайла = ИмяФайла;
	НовыйЭлемент.Расширение = Расширение;
	НовыйЭлемент.Хранилище = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(АдресФайла), Новый СжатиеДанных(9));
	НовыйЭлемент.Записать();
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьФайл(Команда)
	Перем ВыбранноеИмяФайла, АдресФайла;
	ПоместитьФайл(АдресФайла,,ВыбранноеИмяФайла, Истина, УникальныйИдентификатор);
	ЗагрузитьФайлНаСервере(АдресФайла, ВыбранноеИмяФайла);
	Элементы.Список.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура СоздатьИзШаблона(Команда)
	СписокШаблонов = НОвый СписокЗначений;
	СписокШаблонов.Добавить("Документ.ЗаявкаНаТендер.ПФ_MXL_ОсновнаяСтраницаТендера", "Приложение");
	СписокШаблонов.Добавить("Документ.ЗаявкаНаТендер.ПФ_MXL_ТоварыДляТендера", "Приложение товары");
	СписокШаблонов.Добавить("", "Пустой макет");
	ВыбранныйШаблон = СписокШаблонов.ВыбратьЭлемент("Выберите шаблон для создания");
	Если ВыбранныйШаблон = Неопределено Тогда
		Возврат
	КонецЕсли;
	Если Не ПустаяСтрока(ВыбранныйШаблон.Значение) Тогда
		ТабДок =  УправлениеПечатью.МакетПечатнойФормы(ВыбранныйШаблон.Значение);
	Иначе
		ТабДок = Новый ТабличныйДокумент;	
	КонецЕсли;
	Оповещение = Новый ОписаниеОповещения("ОповещениеЗакрытиеФормыРедактированиеТабличногоДокумента", ЭтотОбъект);
	стрПараметры = Новый Структура;
	стрПараметры.Вставить("ТабличныйДокумент", ТабДок);
	стрПараметры.Вставить("Редактирование", Истина);
	стрПараметры.Вставить("ИмяОбъектаМетаданныхМакета", ВыбранныйШаблон.Представление);  
	стрПараметры.Вставить("ИмяДокумента", ВыбранныйШаблон.Представление);
	стрПараметры.Вставить("ОбъектВладелец", Объект);
	//Режим = РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс;
	ОткрытьФорму("ОбщаяФорма.РедактированиеТабличногоДокумента", стрПараметры, ЭтаФорма, УникальныйИдентификатор,,, Оповещение);
КонецПроцедуры

&НаСервере
Процедура СписокВыборНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ТекСтрока = Элементы.Список.ТекущиеДанные;	
	ТабДокМакета = УправлениеПечатью.ПОлучитьТабДокПользовательскогоМакета(ТекСтрока.ИмяМакета, Объект);
	Если ТабДокМакета = Неопределено Тогда
		Сообщить("НЕ удалось получить макет для объекта " + Объект, СтатусСообщения.Важное);
		Возврат;
	КонецЕсли;
	
	Оповещение = Новый ОписаниеОповещения("ОповещениеЗакрытиеФормыРедактированиеТабличногоДокумента", ЭтотОбъект);
	стрПараметры = Новый Структура;
	стрПараметры.Вставить("ТабличныйДокумент", ТабДокМакета);
	стрПараметры.Вставить("РедактированиеСтарогоМакета", Истина);
	стрПараметры.Вставить("Редактирование", Истина);
	стрПараметры.Вставить("ИмяОбъектаМетаданныхМакета", ТекСтрока.ИмяМакета);  
	стрПараметры.Вставить("ИмяДокумента", ТекСтрока.ИмяМакета);
	стрПараметры.Вставить("ОбъектВладелец", Объект);
	//Режим = РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс;
	ОткрытьФорму("ОбщаяФорма.РедактированиеТабличногоДокумента", стрПараметры, ЭтаФорма, УникальныйИдентификатор,,, Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеЗакрытиеФормыРедактированиеТабличногоДокумента(РезультатФормы, ДополнительныеПараметры) Экспорт 
	Элементы.Список.Обновить();
КонецПроцедуры
